app/views/group_members/_index.html.haml

SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = $1  [["group_id", 4]]
---
  %tbody
    - @group.group_member_listings.includes(:member_of_group).each do |group_member|