app/controllers/attendees_controller.rb

  def create
    @attendee = Attendee.new
    @attendee.event_id = params[:event_id]
    @attendee.user_id = current_user.id

    respond_to do |format|
      if @attendee.save
---
INSERT INTO "attendees" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 3], ["user_id", 1], ["created_at", "2022-02-15 19:33:18.213107"], ["updated_at", "2022-02-15 19:33:18.213107"]]

  def destroy
    @attendee.destroy
---
DELETE FROM "attendees" WHERE "attendees"."id" = $1  [["id", 1]]

    def set_attendee
      @attendee = Attendee.find(params[:id])
---
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]