app/controllers/chats_controller.rb

  def create
    @chat = Chat.new(chat_params)
    @chat.author_id = current_user.id
    @chat.event_id = params[:event_id]

    respond_to do |format|
      if @chat.save
---
INSERT INTO "chats" ("event_id", "author_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"