app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all.includes(:group, :game)

SELECT "chats".* FROM "chats" WHERE "chats"."event_id" = $1  [["event_id", 3]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "attendees"."id" FROM "attendees" WHERE "attendees"."user_id" = $1 AND "attendees"."event_id" = $2  [["user_id", 1], ["event_id", 3]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."user_id" = $1 AND "attendees"."event_id" = $2  [["user_id", 1], ["event_id", 3]]
---
  def show
    @chat = Chat.new
    @chats = @event.chats.includes(:author)
    @group = @event.group
    @members = @group.members.pluck(:username)
    @members += [@group.admin.username]
    @game = @event.game
    @attendee = Attendee.new
    @attendees = @event.attendees.pluck(:username)
    @current_user = current_user
    @attending = Attendee.where(user_id: current_user.id).where(event_id: @event.id)

SELECT  "games".* FROM "games" WHERE "games"."game_name" = $1 LIMIT $2  [["game_name", "Halo Infinite"], ["LIMIT", 1]]
INSERT INTO "events" ("group_id", "game_id", "required_players", "details", "date", "created_at", "updated_at", "author_id", "admin_id", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    game_id = params[:event][:game_id]
    game = Game.find_by(game_name: game_id)
    @event.game_id = game.id if game
    @event = Event.new(event_params)
    @event.group_id = params[:group_id]
    @event.author_id = current_user.id
    @event.admin_id = params[:admin_id].to_i

    respond_to do |format|
      if @event.save