app/controllers/friends_controller.rb

  def create

    new_friend = User.find_by(username: friend_params[:friend_2_id]) #verifies that the username entered belongs to another user in the system before creating new friend row.

    if new_friend && (new_friend != current_user) #makes sure that the user isn't trying to friend themselves, and formats data for creating new friend row.
      @friend = Friend.new({ friend_1_id: current_user.id, friend_2_id: new_friend.id })
    else
      @friend = Friend.new({ friend_1_id: current_user.id})
    end

    if @friend.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "CarCrashHeartLess"], ["LIMIT", 1]]
INSERT INTO "friends" ("friend_1_id", "friend_2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["friend_1_id", 1], ["friend_2_id", 2], ["created_at", "2022-02-03 19:55:28.420468"], ["updated_at", "2022-02-03 19:55:28.420468"]]

  def destroy

    if @friend.destroy
---
DELETE FROM "friends" WHERE "friends"."id" = $1  [["id", 1]]