app/controllers/groups_controller.rb

  def show
    @group_member = GroupMember.new
    @group_member.group_id = params[:id]
    @friends = Friend.get_friends(current_user)
    @current_user = current_user
    @event = Event.new
    @events = Group.find_by(id: params[:id]).events
    @games = Game.all.pluck(:game_name, :id)
---
SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = $1  [["group_id", 4]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."group_id" = $1  [["group_id", 4]]
SELECT "games"."game_name", "games"."id" FROM "games"

  def create
    @group = Group.new(group_params)
    @group.admin_id = current_user.id

    if @group.save
---
INSERT INTO "groups" ("admin_id", "group_name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["admin_id", 1], ["group_name", "Halo"], ["description", "Smashing baddies all day!"], ["created_at", "2022-02-10 09:53:17.968055"], ["updated_at", "2022-02-10 09:53:17.968055"]]

  def update

    new_admin_id = params[:group][:admin_id].to_i

    respond_to do |format|
      if @group.update(group_params)
        if new_admin_id != current_user.id
          demoted_admin = GroupMember.new({
              user_id: current_user.id,
              group_id: @group.id
            })
          if demoted_admin.save
            flash[:demote_admin] = "You made a successful transition into a member of this group."
          else
            debugger
            flash[:admin_change_error] = "Sorry we weren't able change you into a member of this group due to an internal error."
          end

          new_admins_old_member_listing = GroupMember.where(user_id: new_admin_id).where(group_id: @group.id).first
          new_admin = User.find_by(id: new_admin_id)

          if new_admins_old_member_listing
            new_admins_old_member_listing.destroy
            debugger
            flash[:new_admin] = "#{new_admin.username} was promoted to admin of this group."
          end
        end
        format.html { redirect_to "/groups/#{@group.id}", notice: 'Group was successfully updated.' }
        format.json { render :show, status: :ok, location: @group }
      else
        format.html { redirect_to "/groups/#{@group.id}", alert: @group.errors.full_messages.first }
---
UPDATE "groups" SET "group_name" = $1, "admin_id" = $2, "updated_at" = $3 WHERE "groups"."id" = $4  [["group_name", "Champions of Gloomhaven!!"], ["admin_id", 1], ["updated_at", "2022-02-18 19:19:16.798885"], ["id", 11]]
INSERT INTO "group_members" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 11], ["user_id", 1], ["created_at", "2022-02-18 17:50:20.014770"], ["updated_at", "2022-02-18 17:50:20.014770"]]
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."user_id" = $1 AND "group_members"."group_id" = $2 ORDER BY "group_members"."id" ASC LIMIT $3  [["user_id", 6], ["group_id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "group_members" WHERE "group_members"."id" = $1  [["id", 41]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def destroy
    if @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 6]]