app/controllers/group_members_controller.rb

  def create
    @group_member = GroupMember.new(group_member_params)

    if @group_member.save
      redirect_to "/groups/#{@group_member.group_id}", notice: "New member was successfully added to group."
---
INSERT INTO "group_members" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 4], ["user_id", 2], ["created_at", "2022-02-08 03:15:03.341859"], ["updated_at", "2022-02-08 03:15:03.341859"]]
SELECT  "group_members".* FROM "group_members" ORDER BY "group_members"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def destroy
    @group_member.destroy
---
DELETE FROM "group_members" WHERE "group_members"."id" = $1  [["id", 6]]

    def set_group_member
      @group_member = GroupMember.find(params[:id])
---
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]